List Mixcode=["CH19CH23","CH20CH23","CH28CH23","CH02CL01","CH27CH23","CH19CL2"];
List  Location=["A","A","D","D","A","A"];
List Time=[0,10,0,13,9,0];
List Message=["","گلوله دقیقا به اعضای حیاتی خورده و قاتل حرفه ای بوده","","گوشی یه ایمیل ناشناس دریافت کرده که دارای لوکیشن و زمان قرار بوده احتمالا داشته می رفته سر قرار","تمام فیلم های دوربین ها پاک شده و تنها این تیکه فیلم رو تونستیم بازیابی کنیم فعلا!",""];
List dialog=["گلوله از نزدیک شلیک شده ولی روی گردنش یه سری جای خراش هست انگار چیزی از گردنش دزدیده شده و شبیه یه سرقت ساده بوده","","از دور که دیدم فکر کردم حالش بد شده و افتاده زمین وقتی جلوتر رفتم و حون رو دیدم متوجه حادثه شدم. قاتل خیلی سریع بوده چون من معمولا زیاد اونجا رفت و امد دارم و این اتفاق زمانی افتاده که من نبودم.","","","این یه نشونه مشکوکه که توی چندتا محل قتل دیگم دیده شده، به نظر یه علامت خاصه و معنا داره"];
List Status=["","Message","","Message","VMessage",""];